### import pandas

In [1]:
import pandas as pd

In [2]:
pwd #untuk mengetahui dimana jupyter notebook berjalan

'D:\\Python\\JupyterNotebook'

### Membuat Series dan DataFrame

#### Membuat Series dan coba-coba

In [3]:
# membuat series
obj = pd.Series([2, 4, 1, 3])
obj

# membuat series dengan indeksnya
obj2 = pd.Series([2, -4, 1, -3, 5], index = ['a','b','c','d','f'])
obj2

a    2
b   -4
c    1
d   -3
f    5
dtype: int64

In [4]:
# melihat isi series
obj2.values

array([ 2, -4,  1, -3,  5], dtype=int64)

In [5]:
# melihat indeks
obj2.index

Index(['a', 'b', 'c', 'd', 'f'], dtype='object')

In [6]:
obj2['a']

2

In [7]:
obj2[['a','b']]

a    2
b   -4
dtype: int64

In [8]:
obj2[obj2 < 3]

a    2
b   -4
c    1
d   -3
dtype: int64

In [9]:
obj2

a    2
b   -4
c    1
d   -3
f    5
dtype: int64

In [10]:
obj2*2

a     4
b    -8
c     2
d    -6
f    10
dtype: int64

In [11]:
'f' in obj2

True

In [12]:
# membuat series dengan dictionary
dic = {'Jakarta': 2000, 'Bandung' : 3200, 'Semarang': 2200, 'Serang': 1200, 'Surabaya': 3000, 'Jogjakarta':2500}
obj3 = pd.Series(dic)
obj3

Jakarta       2000
Bandung       3200
Semarang      2200
Serang        1200
Surabaya      3000
Jogjakarta    2500
dtype: int64

In [13]:
kota = ['Tangerang','Bandung', 'Depok', 'Bekasi', 'Bogor', 'Cirebon', 'Tegal','Jakarta']

In [14]:
obj4 = pd.Series(dic, index = kota)

In [15]:
obj4

Tangerang       NaN
Bandung      3200.0
Depok           NaN
Bekasi          NaN
Bogor           NaN
Cirebon         NaN
Tegal           NaN
Jakarta      2000.0
dtype: float64

In [16]:
# cek apakah di obj4 ada NaN
obj4.isnull()

Tangerang     True
Bandung      False
Depok         True
Bekasi        True
Bogor         True
Cirebon       True
Tegal         True
Jakarta      False
dtype: bool

In [17]:
obj3

Jakarta       2000
Bandung       3200
Semarang      2200
Serang        1200
Surabaya      3000
Jogjakarta    2500
dtype: int64

In [18]:
obj3.name = 'Jumlah populasi'
obj3.index.name = 'Kota'

In [19]:
obj3

Kota
Jakarta       2000
Bandung       3200
Semarang      2200
Serang        1200
Surabaya      3000
Jogjakarta    2500
Name: Jumlah populasi, dtype: int64

#### Membuat DataFrame dan coba-coba

In [20]:
# Membuat DataFrame dari dictionary-dictionary yang sama panjang

data = {'Nama': ['Asep','Budi','Surya','Seno'], 
        'Lahir':[2004, 2002, 2002, 2003],
       'Nilai':[80,76,82,88]}

In [21]:
frame = pd.DataFrame(data)
frame

    Nama  Lahir  Nilai
0   Asep   2004     80
1   Budi   2002     76
2  Surya   2002     82
3   Seno   2003     88

In [22]:
frame.columns

Index(['Nama', 'Lahir', 'Nilai'], dtype='object')

In [23]:
frame.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
# mengindeks kolom

frame['Nilai']

0    80
1    76
2    82
3    88
Name: Nilai, dtype: int64

In [25]:
frame.Nama

0     Asep
1     Budi
2    Surya
3     Seno
Name: Nama, dtype: object

In [26]:
# mengindeks baris

frame.loc[0]

Nama     Asep
Lahir    2004
Nilai      80
Name: 0, dtype: object

In [27]:
indx = ['Nama','Kelas','Nilai','Lahir']
frame2 = pd.DataFrame(data, columns = indx)

In [28]:
frame2

    Nama Kelas  Nilai  Lahir
0   Asep   NaN     80   2004
1   Budi   NaN     76   2002
2  Surya   NaN     82   2002
3   Seno   NaN     88   2003

In [29]:
frame2.Kelas = 9

In [30]:
frame2

    Nama  Kelas  Nilai  Lahir
0   Asep      9     80   2004
1   Budi      9     76   2002
2  Surya      9     82   2002
3   Seno      9     88   2003

In [31]:
#MENGHAPUS COLUMN
#buat column yang akan di hapus
frame2['contoh'] = frame2.Nilai == 80
frame2

    Nama  Kelas  Nilai  Lahir  contoh
0   Asep      9     80   2004    True
1   Budi      9     76   2002   False
2  Surya      9     82   2002   False
3   Seno      9     88   2003   False

In [32]:
#menghapus column menggunakan del
del frame2['contoh']

In [33]:
frame2

    Nama  Kelas  Nilai  Lahir
0   Asep      9     80   2004
1   Budi      9     76   2002
2  Surya      9     82   2002
3   Seno      9     88   2003

In [34]:
frame2.values

array([['Asep', 9, 80, 2004],
       ['Budi', 9, 76, 2002],
       ['Surya', 9, 82, 2002],
       ['Seno', 9, 88, 2003]], dtype=object)

In [35]:
frame2.columns

Index(['Nama', 'Kelas', 'Nilai', 'Lahir'], dtype='object')

In [51]:
pd.DataFrame([[1,2],[3,4]], index = ['satu','dua'], columns = ['A','B'])

      A  B
satu  1  2
dua   3  4

In [52]:
pd.DataFrame({'Coba':{'A':1, 'B':2},'cuba':{'A':3,'B':4}})

   Coba  cuba
A     1     3
B     2     4

#### Indexing DataFrame

In [49]:
frame2.index

RangeIndex(start=0, stop=4, step=1)

In [53]:
frame2

    Nama  Kelas  Nilai  Lahir
0   Asep      9     80   2004
1   Budi      9     76   2002
2  Surya      9     82   2002
3   Seno      9     88   2003

In [56]:
frame2.loc[0]

Nama     Asep
Kelas       9
Nilai      80
Lahir    2004
Name: 0, dtype: object

In [57]:
frame2.columns

Index(['Nama', 'Kelas', 'Nilai', 'Lahir'], dtype='object')

In [58]:
[1,2,3].index(2)

1